Aplicacao Web/yii-application/frontend/controllers/UserprofilesController.php

    public function actionCreate()
    {
        $model = new Userprofiles();
        $id = Yii::$app->user->identity->getId();
        //var_dump($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `userprofiles` (`firstname`, `surnames`, `birthdate`, `sex`, `user_id`, `team_id`) VALUES ('Diogo', 'Alpendre', '1999-03-04', 1, 18, NULL)

    protected function findModel($id)
    {
        if (($model = Userprofiles::findOne($id)) !== null) {
---
SELECT * FROM `userprofiles` WHERE `id`='5'